Revit 2027 API
FamilyThermalProperties.Find Method
 Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FamilyThermalProperties Find(
	Document pADoc,
	string constructionId
)
Public Shared Function Find (
	pADoc As Document,
	constructionId As String
) As FamilyThermalProperties
public:
static FamilyThermalProperties^ Find(
	Document^ pADoc,
	String^ constructionId
)
static member Find :
        pADoc : Document *
        constructionId : string -> FamilyThermalProperties
Parameters
pADoc Document
 The document.
constructionId String
 The 'id' property of a constructionType node in Constructions.xml
Return Value
FamilyThermalProperties
 The thermal properties found, or null if no match was found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace